In [1]:
import pandas as pd
data = {'Name':['Alice','Bob','Charlie','David','Eva'],
        'Age':[23,35,45,36,28],
        'City':['New York','LosAngeles','Chicago','Houston','Phoenix']}
df = pd.DataFrame(data)
print(df)

      Name  Age        City
0    Alice   23    New York
1      Bob   35  LosAngeles
2  Charlie   45     Chicago
3    David   36     Houston
4      Eva   28     Phoenix

In [2]:
df.iloc[2]

Name    Charlie
Age          45
City    Chicago
Name: 2, dtype: object

In [3]:
df.iloc[:]['Age']

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

In [4]:
df.iloc[:3]

      Name  Age        City
0    Alice   23    New York
1      Bob   35  LosAngeles
2  Charlie   45     Chicago

In [5]:
df.iloc[:3][['Name','City']]

      Name        City
0    Alice    New York
1      Bob  LosAngeles
2  Charlie     Chicago

In [6]:
df.loc[df['Name']=='Charlie']

      Name  Age     City
2  Charlie   45  Chicago

In [7]:
df[df['Age']>30]

      Name  Age        City
1      Bob   35  LosAngeles
2  Charlie   45     Chicago
3    David   36     Houston

In [15]:
df.loc[df['Age']>30]

      Name  Age        City
1      Bob   35  LosAngeles
2  Charlie   45     Chicago
3    David   36     Houston

In [19]:
df.loc[(df['City']=='Chicago') | (df['City']=='Houston')]

      Name  Age     City
2  Charlie   45  Chicago
3    David   36  Houston

In [21]:
data = {'Product':['Apple','Banana','Carrot','Doughnut','Egg'],
        'Price':[0.5,0.3,0.4,1.0,0.2],
        'In Stock':[True,True,False,True,False]}
df = pd.DataFrame(data)
print(df)

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.0      True
4       Egg    0.2     False

In [25]:
df.loc[df['In Stock']]

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
3  Doughnut    1.0      True